xiao6hu/test01/USB_MIDI_UC_OS2_20191123/2.9.0/CMSIS/Driver/USART_STM32F2xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2018 Arm Limited
 *
 * This software is provided 'as-is', without any express or implied warranty.
 * In no event will the authors be held liable for any damages arising from
 * the use of this software. Permission is granted to anyone to use this
 * software for any purpose, including commercial applications, and to alter
 * it and redistribute it freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software in
 *    a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 *
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 *
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *
 * $Date:        12. March 2018
 * $Revision:    V2.8
 *
 * Driver:       Driver_USART1, Driver_USART2, Driver_USART3,
 *               Driver_USART4, Driver_USART5, Driver_USART6,
 * Configured:   via RTE_Device.h or MX_Device.h configuration file
 * Project:      USART Driver for ST STM32F2xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                   Value   UART Interface
 *   ---------------------                   -----   --------------
 *   Connect to hardware via Driver_USART# = 1       use USART1
 *   Connect to hardware via Driver_USART# = 2       use USART2
 *   Connect to hardware via Driver_USART# = 3       use USART3
 *   Connect to hardware via Driver_USART# = 4       use UART4
 *   Connect to hardware via Driver_USART# = 5       use UART5
 *   Connect to hardware via Driver_USART# = 6       use USART6
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 2.8
 *    Added support for ARM Compiler 6
 *    GPIO speed is configurable
 *  Version 2.6
 *    Corrected CTS handling and added Signal CTS change event.
 *  Version 2.5
 *    Adapted PowerControl function for:
 *      - use of STM32Cube FW F2 V1.3.0
 *  Version 2.4
 *    Corrected PowerControl function for:
 *      - Unconditional Power Off
 *      - Conditional Power full (driver must be initialized)
 *  Version 2.3
 *    Corrected unwanted receive stop (Caused by calling USART_Receive function, while receiver is still busy.)
 *    Removed checking if Asynchronous Single-wire mode has been configured in CubeMX
 *  Version 2.2
 *    - Added RX Timeout handling
 *    - PowerControl for Power OFF and Uninitialize functions made unconditional.
 *    - Corrected status bit-field handling, to prevent race conditions.
 *  Version 2.1
 *    STM32CubeMX generated code can also be used to configure the driver
 *  Version 2.0
 *    Updated to CMSIS Driver API V2.00
 *  Version 1.1
 *    Based on API V1.10 (namespace prefix ARM_ added)
 *  Version 1.0
 *    Initial release
 */

 /*! \page stm32f2_usart CMSIS-Driver USART Setup

The CMSIS-Driver USART requires:
  - Setup of USART/UART mode (Asynchronous, Synchronous, Single wire, IrDA or SmartCard)
  - Optional configuration of Hardware Flow Control (only in Asynchronous mode).
 
Valid settings for various evaluation boards are listed in the table below:

Peripheral Resource | MCBSTM32F200        | MCBSTM32F200        | STM3220G-EVAL
:-------------------|:--------------------|:--------------------|:-------------
USART Peripheral    | USART1              | USART3/UART4        | USART3/UART4
USART Mode          | <b>Asynchronous</b> | <b>Asynchronous</b> | <b>Asynchronous</b>
TX Pin              | PB6                 | PC10                | PC10
RX Pin              | PB7                 | PC11                | PC11

For different boards, refer to the hardware schematics to reflect correct setup values.

The STM32CubeMX configuration for MCBSTM32F200 with steps for Pinout, Clock, and System Configuration are 
listed below. Enter the values that are marked \b bold.
   
Pinout tab
----------
  1. Configure USART1 mode
     - Peripherals \b USART1: Mode=<b>Asynchronous</b>, Hardware Flow Control=<b>Disable</b>
          
Clock Configuration tab
-----------------------
  1. Configure USART1 Clock.
  
Configuration tab
-----------------
  1. Under Connectivity open \b USART1 Configuration:
     - \e optional <b>DMA Settings</b>: setup DMA transfers for Rx and Tx (DMA is optional)\n
       \b Add - Select \b USART1_RX: Stream=DMA2 Stream 2, DMA Request Settings: not used\n
       \b Add - Select \b USART1_TX: Stream=DMA2 Stream 7, DMA Request Settings: not used

     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin | GPIO mode | GPIO Pull-up/Pull..| Maximum out | User Label
          :--------|:--------------|:----------|:-------------------|:------------|:----------
          PB6      | USART1_TX     | Alternate | Pull-up            | High        |.  
          PB7      | USART1_RX     | Alternate | Pull-up            | High        |.
     - <b>NVIC Settings</b>: enable interrupts
          Interrupt Table                      | Enable | Preemption Priority | Sub Priority
          :------------------------------------|:-------|:--------------------|:--------------
          USART1 global interrupt              |\b ON   | 0                   | 0
          DMA2 stream2 global interrupt        |   ON   | 0                   | 0
          DMA2 stream7 global interrupt        |   ON   | 0                   | 0
     - Parameter Settings: not used
     - User Constants: not used
     - Click \b OK to close the USART1 Configuration dialog
*/
 
/*! \cond */

#include "USART_STM32F2xx.h"

#define ARM_USART_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(2,8)

// Driver Version
static const ARM_DRIVER_VERSION usart_driver_version = { ARM_USART_API_VERSION, ARM_USART_DRV_VERSION };

// USART1
#ifdef MX_USART1

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART1_VM == VM_ASYNC)
extern UART_HandleTypeDef huart1;
#elif (MX_USART1_VM == VM_SYNC)
extern USART_HandleTypeDef husart1;
#elif (MX_USART1_VM == VM_IRDA)
extern IRDA_HandleTypeDef hirda1;
#elif (MX_USART1_VM == VM_SMARTCARD)
extern SMARTCARD_HandleTypeDef hsc1;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

