xiao6hu/test01/USB_MIDI_UC_OS2_20191123/2.9.0/CMSIS/Driver/USART_STM32F2xx.c
// USART1 Run-Time Information
static USART_INFO          USART1_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO USART1_TransferInfo;

#ifdef MX_USART1_TX_Pin
  static USART_PIN USART1_tx =  {MX_USART1_TX_GPIOx,  MX_USART1_TX_GPIO_Pin,  MX_USART1_TX_GPIO_AF,  MX_USART1_TX_GPIO_PuPd,  MX_USART1_TX_GPIO_Speed};
#endif
#ifdef MX_USART1_RX_Pin
  static USART_PIN USART1_rx =  {MX_USART1_RX_GPIOx,  MX_USART1_RX_GPIO_Pin,  MX_USART1_RX_GPIO_AF,  MX_USART1_RX_GPIO_PuPd,  MX_USART1_RX_GPIO_Speed};
#endif
#ifdef MX_USART1_CK_Pin
  static USART_PIN USART1_ck =  {MX_USART1_CK_GPIOx,  MX_USART1_CK_GPIO_Pin,  MX_USART1_CK_GPIO_AF,  MX_USART1_CK_GPIO_PuPd,  MX_USART1_CK_GPIO_Speed};
#endif
#ifdef MX_USART1_RTS_Pin
  static USART_PIN USART1_rts = {MX_USART1_RTS_GPIOx, MX_USART1_RTS_GPIO_Pin, MX_USART1_RTS_GPIO_AF, MX_USART1_RTS_GPIO_PuPd, MX_USART1_RTS_GPIO_Speed};
#endif
#ifdef MX_USART1_CTS_Pin
  static USART_PIN USART1_cts = {MX_USART1_CTS_GPIOx, MX_USART1_CTS_GPIO_Pin, MX_USART1_CTS_GPIO_AF, MX_USART1_CTS_GPIO_PuPd, MX_USART1_CTS_GPIO_Speed};
#endif

#ifdef MX_USART1_TX_DMA_Instance
  static void USART1_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart1_tx;
#else
  extern DMA_HandleTypeDef hdma_usart1_tx;
#endif
  static USART_DMA USART1_DMA_Tx = {
    &hdma_usart1_tx,
    USART1_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART1_TX_DMA_Instance,
    MX_USART1_TX_DMA_Channel,
    MX_USART1_TX_DMA_Priority,
    MX_USART1_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_USART1_RX_DMA_Instance
  static void USART1_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart1_rx;
#else
  extern DMA_HandleTypeDef hdma_usart1_rx;
#endif
  static USART_DMA USART1_DMA_Rx = {
    &hdma_usart1_rx,
    USART1_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART1_RX_DMA_Instance,
    MX_USART1_RX_DMA_Channel,
    MX_USART1_RX_DMA_Priority,
    MX_USART1_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// USART1 Resources
static const USART_RESOURCES USART1_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART1_VM == VM_ASYNC)
  &huart1,
  VM_ASYNC,
#elif (MX_USART1_VM == VM_SYNC)
  &husart1,
  VM_SYNC,
#elif (MX_USART1_VM == VM_IRDA)
  &hirda1,
  VM_IRDA,
#elif (MX_USART1_VM == VM_SMARTCARD)
  &hsc1,
  VM_SMARTCARD,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef MX_USART1_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    1,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef MX_USART1_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef MX_USART1_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#ifdef MX_USART1_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef MX_USART1_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef MX_USART1_CTS_Pin
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    USART1,
    HAL_RCC_GetPCLK2Freq,

  // PINS
  {
#ifdef MX_USART1_TX_Pin
    &USART1_tx,
#else
    NULL,
#endif
#ifdef MX_USART1_RX_Pin
    &USART1_rx,
#else
    NULL,
#endif
#ifdef MX_USART1_CK_Pin
    &USART1_ck,
#else
    NULL,
#endif
#ifdef MX_USART1_RTS_Pin 
    &USART1_rts,
#else
    NULL,
#endif
#ifdef MX_USART1_CTS_Pin 
    &USART1_cts,
#else
    NULL,
#endif
  },

    USART1_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_USART1_TX_DMA_Instance
  &USART1_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_USART1_RX_DMA_Instance
  &USART1_DMA_Rx,
#else
  NULL,
#endif

  &USART1_Info,
  &USART1_TransferInfo
};
#endif

// USART2
#ifdef MX_USART2

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART2_VM == VM_ASYNC)
extern UART_HandleTypeDef huart2;
#elif (MX_USART2_VM == VM_SYNC)
extern USART_HandleTypeDef husart2;
#elif (MX_USART2_VM == VM_IRDA)
extern IRDA_HandleTypeDef hirda2;
#elif (MX_USART2_VM == VM_SMARTCARD)
extern SMARTCARD_HandleTypeDef hsc2;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// USART2 Run-Time Information
static USART_INFO          USART2_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO USART2_TransferInfo;

#ifdef MX_USART2_TX_Pin
  static USART_PIN USART2_tx =  {MX_USART2_TX_GPIOx,  MX_USART2_TX_GPIO_Pin,  MX_USART2_TX_GPIO_AF,  MX_USART2_TX_GPIO_PuPd,  MX_USART2_TX_GPIO_Speed};
#endif
#ifdef MX_USART2_RX_Pin
  static USART_PIN USART2_rx =  {MX_USART2_RX_GPIOx,  MX_USART2_RX_GPIO_Pin,  MX_USART2_RX_GPIO_AF,  MX_USART2_RX_GPIO_PuPd,  MX_USART2_RX_GPIO_Speed};
#endif
#ifdef MX_USART2_CK_Pin
  static USART_PIN USART2_ck =  {MX_USART2_CK_GPIOx,  MX_USART2_CK_GPIO_Pin,  MX_USART2_CK_GPIO_AF,  MX_USART2_CK_GPIO_PuPd,  MX_USART2_CK_GPIO_Speed};
#endif
#ifdef MX_USART2_RTS_Pin
  static USART_PIN USART2_rts = {MX_USART2_RTS_GPIOx, MX_USART2_RTS_GPIO_Pin, MX_USART2_RTS_GPIO_AF, MX_USART2_RTS_GPIO_PuPd, MX_USART2_RTS_GPIO_Speed};
#endif
#ifdef MX_USART2_CTS_Pin
  static USART_PIN USART2_cts = {MX_USART2_CTS_GPIOx, MX_USART2_CTS_GPIO_Pin, MX_USART2_CTS_GPIO_AF, MX_USART2_CTS_GPIO_PuPd, MX_USART2_CTS_GPIO_Speed};
#endif

#ifdef MX_USART2_TX_DMA_Instance
  static void USART2_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart2_tx;
#else
  extern DMA_HandleTypeDef hdma_usart2_tx;
#endif
  static USART_DMA USART2_DMA_Tx = {
    &hdma_usart2_tx,
    USART2_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART2_TX_DMA_Instance,
    MX_USART2_TX_DMA_Channel,
    MX_USART2_TX_DMA_Priority,
    MX_USART2_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_USART2_RX_DMA_Instance
  static void USART2_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart2_rx;
#else
  extern DMA_HandleTypeDef hdma_usart2_rx;
#endif
  static USART_DMA USART2_DMA_Rx = {
    &hdma_usart2_rx,
    USART2_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART2_RX_DMA_Instance,
    MX_USART2_RX_DMA_Channel,
    MX_USART2_RX_DMA_Priority,
    MX_USART2_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// USART2 Resources
static const USART_RESOURCES USART2_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART2_VM == VM_ASYNC)
  &huart2,
  VM_ASYNC,
#elif (MX_USART2_VM == VM_SYNC)
  &husart2,
  VM_SYNC,
#elif (MX_USART2_VM == VM_IRDA)
  &hirda2,
  VM_IRDA,
#elif (MX_USART2_VM == VM_SMARTCARD)
  &hsc2,
  VM_SMARTCARD,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
#ifdef MX_USART2_CK_Pin
    1,  // supports Synchronous Master mode
#else
    0,  // supports Synchronous Master mode
#endif
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    1,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
#ifdef MX_USART2_RTS_Pin
    1,  // RTS Flow Control available
#else
    0,  // RTS Flow Control available
#endif
#ifdef MX_USART2_CTS_Pin
    1,  // CTS Flow Control available
#else
    0,  // CTS Flow Control available
#endif
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
#ifdef MX_USART2_RTS_Pin
    1,  // RTS Line: 0=not available, 1=available
#else
    0,  // RTS Line: 0=not available, 1=available
#endif
#ifdef MX_USART2_CTS_Pin
    1,  // CTS Line: 0=not available, 1=available
#else
    0,  // CTS Line: 0=not available, 1=available
#endif
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
#ifdef MX_USART2_CTS_Pin
    1,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    USART2,
    HAL_RCC_GetPCLK1Freq,

