xiao6hu/test01/USB_MIDI_UC_OS2_20191123/2.9.0/CMSIS/Driver/USART_STM32F2xx.c
  // PINS
  {
#ifdef MX_UART4_TX_Pin
    &UART4_tx,
#else
    NULL,
#endif
#ifdef MX_UART4_RX_Pin
    &UART4_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
  },

    UART4_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_UART4_TX_DMA_Instance
  &UART4_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART4_RX_DMA_Instance
  &UART4_DMA_Rx,
#else
  NULL,
#endif

  &UART4_Info,
  &UART4_TransferInfo
};
#endif

// UART5
#ifdef MX_UART5

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART5_VM == Asynchronous)
extern UART_HandleTypeDef huart5;
#elif (MX_UART5_VM == IrDA)
extern IRDA_HandleTypeDef hirda5;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// UART5 Run-Time Information
static USART_INFO          UART5_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO UART5_TransferInfo;

#ifdef MX_UART5_TX_Pin
  static USART_PIN UART5_tx = {MX_UART5_TX_GPIOx,  MX_UART5_TX_GPIO_Pin,  MX_UART5_TX_GPIO_AF, MX_UART5_TX_GPIO_PuPd, MX_UART5_TX_GPIO_Speed};
#endif
#ifdef MX_UART5_RX_Pin
  static USART_PIN UART5_rx = {MX_UART5_RX_GPIOx,  MX_UART5_RX_GPIO_Pin,  MX_UART5_RX_GPIO_AF, MX_UART5_RX_GPIO_PuPd, MX_UART5_RX_GPIO_Speed};
#endif

#ifdef MX_UART5_TX_DMA_Instance
  static void UART5_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart5_tx;
#else
  extern DMA_HandleTypeDef hdma_uart5_tx;
#endif
  static USART_DMA UART5_DMA_Tx = {
    &hdma_uart5_tx,
    UART5_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART5_TX_DMA_Instance,
    MX_UART5_TX_DMA_Channel,
    MX_UART5_TX_DMA_Priority,
    MX_UART5_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_UART5_RX_DMA_Instance
  static void UART5_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_uart5_rx;
#else
  extern DMA_HandleTypeDef hdma_uart5_rx;
#endif
  static USART_DMA UART5_DMA_Rx = {
    &hdma_uart5_rx,
    UART5_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_UART5_RX_DMA_Instance,
    MX_UART5_RX_DMA_Channel,
    MX_UART5_RX_DMA_Priority,
    MX_UART5_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

// UART5 Resources
static const USART_RESOURCES USART5_Resources = {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_UART5_VM == Asynchronous)
  &huart5,
  VM_ASYNC,
#elif (MX_UART5_VM == IrDA)
  &hirda5,
  VM_IRDA,
#endif
#endif
  {     // Capabilities
    1,  // supports UART (Asynchronous) mode
    0,  // supports Synchronous Master mode
    0,  // supports Synchronous Slave mode
    1,  // supports UART Single-wire mode
    1,  // supports UART IrDA mode
    0,  // supports UART Smart Card mode
    0,  // Smart Card Clock generator
    0,  // RTS Flow Control available
    0,  // CTS Flow Control available
    1,  // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    1,  // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    0,  // RTS Line: 0=not available, 1=available
    0,  // CTS Line: 0=not available, 1=available
    0,  // DTR Line: 0=not available, 1=available
    0,  // DSR Line: 0=not available, 1=available
    0,  // DCD Line: 0=not available, 1=available
    0,  // RI Line: 0=not available, 1=available
    0,  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    0,  // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    0,  // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    0   // Signal RI change event: \ref ARM_USART_EVENT_RI
#if (defined(ARM_USART_API_VERSION) && (ARM_USART_API_VERSION >= 0x203U))
  , 0U  // Reserved bits
#endif
  },

    UART5,
    HAL_RCC_GetPCLK1Freq,

  // PINS
  {
#ifdef MX_UART5_TX_Pin
    &UART5_tx,
#else
    NULL,
#endif
#ifdef MX_UART5_RX_Pin
    &UART5_rx,
#else
    NULL,
#endif
    NULL,
    NULL,
    NULL,
  },

    UART5_IRQn,
  { 0U, 0U, 0U },

#ifdef MX_UART5_TX_DMA_Instance
  &UART5_DMA_Tx,
#else
  NULL,
#endif
#ifdef MX_UART5_RX_DMA_Instance
  &UART5_DMA_Rx,
#else
  NULL,
#endif

  &UART5_Info,
  &UART5_TransferInfo
};
#endif

// USART6
#ifdef MX_USART6

#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
#if (MX_USART6_VM == VM_ASYNC)
extern UART_HandleTypeDef huart6;
#elif (MX_USART6_VM == VM_SYNC)
extern USART_HandleTypeDef husart6;
#elif (MX_USART6_VM == VM_IRDA)
extern IRDA_HandleTypeDef hirda6;
#elif (MX_USART6_VM == VM_SMARTCARD)
extern SMARTCARD_HandleTypeDef hsc6;
#else
#error "Incorrect virtual mode is selected"
#endif
#endif

// USART6 Run-Time Information
static USART_INFO          USART6_Info = { 0U, { 0U, 0U, 0U, 0U, 0U, 0U, 0U }, 0U, 0U, 0U };
static USART_TRANSFER_INFO USART6_TransferInfo;

#ifdef MX_USART6_TX_Pin
  static USART_PIN USART6_tx = {MX_USART6_TX_GPIOx,  MX_USART6_TX_GPIO_Pin,  MX_USART6_TX_GPIO_AF,  MX_USART6_TX_GPIO_PuPd,  MX_USART6_TX_GPIO_Speed};
#endif
#ifdef MX_USART6_RX_Pin
  static USART_PIN USART6_rx = {MX_USART6_RX_GPIOx,  MX_USART6_RX_GPIO_Pin,  MX_USART6_RX_GPIO_AF,  MX_USART6_RX_GPIO_PuPd,  MX_USART6_RX_GPIO_Speed};
#endif
#ifdef MX_USART6_CK_Pin
  static USART_PIN USART6_ck = {MX_USART6_CK_GPIOx,  MX_USART6_CK_GPIO_Pin,  MX_USART6_CK_GPIO_AF,  MX_USART6_CK_GPIO_PuPd,  MX_USART6_CK_GPIO_Speed};
#endif
#ifdef MX_USART6_RTS_Pin
  static USART_PIN USART6_rts = {MX_USART6_RTS_GPIOx, MX_USART6_RTS_GPIO_Pin, MX_USART6_RTS_GPIO_AF, MX_USART6_RTS_GPIO_PuPd, MX_USART6_RTS_GPIO_Speed};
#endif
#ifdef MX_USART6_CTS_Pin
  static USART_PIN USART6_cts = {MX_USART6_CTS_GPIOx, MX_USART6_CTS_GPIO_Pin, MX_USART6_CTS_GPIO_AF, MX_USART6_CTS_GPIO_PuPd, MX_USART6_CTS_GPIO_Speed};
#endif

#ifdef MX_USART6_TX_DMA_Instance
  static void USART6_TX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart6_tx;
#else
  extern DMA_HandleTypeDef hdma_usart6_tx;
#endif
  static USART_DMA USART6_DMA_Tx = {
    &hdma_usart6_tx,
    USART6_TX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART6_TX_DMA_Instance,
    MX_USART6_TX_DMA_Channel,
    MX_USART6_TX_DMA_Priority,
    MX_USART6_TX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif
#ifdef MX_USART6_RX_DMA_Instance
  static void USART6_RX_DMA_Complete (DMA_HandleTypeDef *hdma);

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  static DMA_HandleTypeDef hdma_usart6_rx;
#else
  extern DMA_HandleTypeDef hdma_usart6_rx;
#endif
  static USART_DMA USART6_DMA_Rx = {
    &hdma_usart6_rx,
    USART6_RX_DMA_Complete,
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
    MX_USART6_RX_DMA_Instance,
    MX_USART6_RX_DMA_Channel,
    MX_USART6_RX_DMA_Priority,
    MX_USART6_RX_DMA_IRQn,
    { 0U, 0U, 0U }
#endif
  };
#endif

